#!/usr/bin/env python
# coding: utf-8

# In[1]:


"""
โจทย์การใช้ if
เหล็กท่อนหนึ่งยาว 17.25 เมตร และอีกท่อนหนึ่งยาว 5.2 เมตร มาเชื่อมกันแล้วตัดออกไปทำขาโต๊ะ 1.6 เมตร จะเหลืออีกกี่เมตร
"""
Steel_1 = float(input("เหล็กท่อนที่ 1 ยาว : "))
Steel_2 = float(input("เหล็กท่อนที่ 2 ยาว : "))
cut     = float(input("ตัดไปทำขาโต๊ะ 1 ขา ยาว : "))
Mix     = Steel_1 + Steel_2
Steel   = Mix - cut
print("จะเหลือเหล็กอีก = ",Steel,"เมตร")
if Steel > 10 :
    print(" Use Steel  ")


# In[2]:


"""
โจทย์การใช้ if else elif
แม่ค้าขายผักสดไป 18.5 กิโลกรัม ราคากิโลกรัมละ 10.50 บาท เอาเงินที่ขายได้ไปซื้อแอปเปิ้ล 
ราคาผลละ 9.75 บาท แม่ค้าจะซื้อแอปเปิ้ลได้ประมาณกี่ผล *กำหนดให้ได้แอปเปิ้ล 19 ผล *
"""
V = float(input("ขายผักสดไป : "))
S = float(input("ราคากิโลกรัมละ : "))
P = float(input("แอปเปิ้ลผลละ : "))
money = V * S
count = int(money // P)
print(" จะได้แอปเปิ้ลประมาณ ",count, "ผล")
if count < 1 :
    print("ไม่สามารถซื้อได้")
elif count > 25 :
    print("เกินจำนวนที่ต้องการ")
else:
    count == 19
    print("ได้ครบตามจำนวน")


# In[3]:


"""
โจทย์การใช้ while loop
โปรโมชั่นทางร้าน ซื้ออาหารมากกว่า 1,000 บาท ขึ้นไป ลดราคา 5 เปอร์เซ็น
------ แม่ค้าร้านอาหาร ------
คิดเงินค่าอาหารให้ลูกค้าโต๊ะที่ 1 รวมเงิน 900 บาท ต้องชำระเงินกี่บาท
คิดเงินค่าอาหารให้ลูกค้าโต๊ะที่ 2 รวมเงิน 1,500 บาท ต้องชำระเงินกี่บาท

"""
while(True):
    Number = int(input("ยอดเงินรวม = "))
    if(Number<1000):
        print("ต้องชำระเงินจำนวน = ",Number,"บาท")
    else:
        Number > 1000
        sale = round(Number * 0.05)
        pay  = Number - sale
        print("คิดราคาโปรโมชั่นต้องชำระเงินจำนวน = ",pay,"บาท")
        break


# In[4]:


"""
โจทย์การใช้ for loop
ห้างสรรพสินค้าแห่งหนึ่ง ขายน้ำตาลทราย ราคาถุงละ 21 บาท แต่ซื้อได้ไม่เกินครอบครัวล่ะ 9 ถุง
โดยติดป้ายราคา ตั้งแต่ถุงที่1 ถึงถุงที่9 ไว้ดังนี้ ให้คำนวณราคาตั้งแต่ถุงที่1-9 ว่ามีราคาเท่าไหร่บ้าง
"""
Price = int(input("ราคาน้ำตาลถุงละ = "))
print("ราคา x จำนวนถุง ")
for i in range(1,10):
    print(Price,"*" , i,"=",Price*i, "บาท")


# In[5]:


"""
ในการเทคอนกรีตพื้นห้องกว้าง 3.75 เมตร ยาว 12.50 เมตร เสียค่าใช้จ่ายตารางเมตรละ 280 บาท
อยากทราบว่าจะต้องเสียเงินในการเทคอนกรีตทั้งหมดกี่บาท
"""
wide  = float(input("พื้นห้องกว้าง = "))
long  = float(input("พื้นห้องยาว  = "))
po   = int(input("จ่ายตารางเมตรละ = "))
mix   = wide * long
print("พื้นที่ห้องมี",mix, "ตารางเมตร")
pay = mix * po 
print("ต้องเสียเงินในการเทคอนกรีต",pay,"บาท")


# In[6]:


"""
ไม้ท่อนหนึ่งยาว 15.65 เมตร ส่วนที่อยู่ในโครน 2.59 เมตร
และส่วนที่อยู่ในน้ำยาว 2.50 เมตร ส่วนที่พ้นน้ำจะยาวกี่เมตร
"""
P = float(input("ไม้ท่อนหนึ่งยาว : "))
O = float(input("ส่วนที่อยู่ในโครน : "))
N = float(input("ส่วนที่อยู่ในน้ำ   : "))
print("ส่วนที่พ้นน้ำจะต้องยาว ",(P-(O+N)),"เมตร")


# In[20]:


"""
นักศึกษาห้องหนึ่งมีจำนวน 50 คน ไม่มาเรียนจำนวน  0.2 ของนักศึกษาทั้งหมด จงหานักศึกษาที่ไม่มาเรียน
"""
count = int(input("จำนวนนักศึกษาทั้งหมด : "))
absent = input("ไม่มาเรียน : ")
m       = round(int(count) *float(absent))
print("นักศึกษาที่ไม่มาเรียน",m,"คน")


# In[21]:


"""
พรทิพย์ซื้อสร้อยคอราคา 13,000.0 บาท ขายไปและขาดทุน 0.035 ของราคาสร้อย  อยากทราบว่าพรทิพย์ขายสร้อยไปราคากี่บาท
"""
Price = float(input("สร้อยราคา : "))
Sale  = float(input("ขาดทุน : "))
print("พรทิพย์ขายสร้อยไปในราคา",int(Price*Sale),"บาท")


# In[22]:


"""
สมมติว่าเดือนหน้า เราจะเดินทางไปนิวซีเเลน มีเงินไทยอยู่ 50,000.0 บาท จะแลกได้เท่าไร
*กำหนดให้ใช้สกุลเงิน NZD โดย 1 NZD = 19.6770 บาทไทย
"""
Thi = float(input("จำนวนเงินไทยที่ต้องการแลก : "))
NZD = float(input(" ค่า 1 NZD :  "))
print("จะแลกได้",((Thi*1)//NZD),"NZD")


# In[23]:


"""
ถ้าไปเที่ยวยุโรปต้องใช้เงินสกุล EUR โดยด้วยแลกเงินแค่ 10,000.0 บาท ต้องแลกได้เท่าไร
*กำหนด 1 EUR = 33.9329 บาท
"""
Thi = float(input("จำนวนเงินไทยที่ต้องการแลก : "))
EUR = float(input(" ค่า 1 EUR :  "))
print("จะแลกได้",((Thi*1)//EUR),"EUR")


# In[ ]:




