'''
Analysis
1.input คือ การนำข้อมูลเข้าทางแป้นพิมพ์ โดยป้อนตัวเลข3ตัว  เว้นแต่ละตัว
2.process คือ เป็นการนำข้อมูลทั้ง 3 ตัว เข้าในเงื่อนไข เพื่อต้องการทราบจำนวนมน้อยที่สุดหรือเท่ากัน
3.output คือ การแสดงผลของตัวเลข ทั้ง3ตัว แต่จะแสดงเพียงค่าเดียวเท่านั้น
4.Define a  Variable คือการกำหนดตัวแปร ในแต่ละข้อมูลเพื่อรับค่าและแสดงผลของค่านั้น

'''

n1,n2,n3 = (int(e) for e in input("number :").split())
if n1<n2 and n1<n3:
    print(n1)
elif n2<n1 and n2<n3:
    print(n2)
elif n3<n1 and n3<n2:
    print(n3)
else:
    print("พบตัวเลขมีค่าเท่ากัน")