#!/usr/bin/env python
# coding: utf-8

# In[23]:


print("CP ALL , 7-Eleven ราชมงคลสุวรรณภูมิ ( L (06582))")
print("  TAX #0107542000011 (VAT Included)")
print("Vat Code 04968 POS#E06720000201242")
print("   ใบเสร็จรับเงิน/ใบกำกับภาษีอย่างย่อ")
print("1"  , "ริซซ์สมอทอล์คREM" , 1    , 199 ,      "THB" ,   (1*199.00), "THB")
print("2"  ,  "ดับเบิ้ลซี รสส้ม", 1 ,    15 , "THB" , (1*15.00) , "THB")
print("ยอดสุทธิ  2 ชิ้น 214.00 THB")
print("total" , (199.00+15.00) , "THB")
print("เงินสด/เงินทอน          220.00             6.00")
print("R#0000371483 P1:0658298     28/06/62        08:15")
print("*** ศูนย์ลูกค้าสัมพันธ์ 0-2826-7777 ***")
print("---------------------------------------------")
print("ข้อมูลสมาชิก  คุณทิพลดา ภู่มาลา")
print("                                        ได้รับ          ใช้ไป    คงเหลือ")
print("แต้มสมาชิก                         +107            0         272")
print("**ยอดใช้ไปและยอดคงเหลือ ไม่รวมยอดสะสมครั้งนี้")
print("------------------------------------------------------------")


# In[ ]:




