'''
Analysis
1.input คือ การนำข้อมูลเข้าทางแป้นพิมพ์ โดยป้อนตัวเลขไปเรื่อยๆ จนเจอค่าที่น้อยกว่า 0
2.process คือ เป็นการนำข้อมูลทั้งหมดมาประมวลผล เข้าคำสั่งการวนซ้ำเพื่อรับค่าที่มากกว่า 0 แต่ถ้าเจอค่าที่น้อยกว่า 0 โปรแกรมจะหยุดรับค่า
3.output คือ การแสดงผลของค่ามากที่สุด
4.Define a  Variable คือการกำหนดตัวแปร ในแต่ละข้อมูลเพื่อรับค่าและแสดงผลของค่านั้น
'''

max = 0
number = int(input(" Number :"))
while number > 0:
    if number > max:
        max = number
    number = int(input(" Number :"))
print("จำนวนที่มีค่ามากที่สุด :", max)