

'''Analysis
1.input คือ การนำข้อมูลเข้าทางแป้นพิมพ์ ในโปรแกรมนี้เป็นการกรอกเลข เพื่อรันสูตรคูน
2.process คือ การประมวลผลทางการคำนวณ จะได้ ตัวหน้า คูนด้วยตัวหลัง เป็นการวนซ้ำจนกว่าจครบในสิ่งที่กำหนด
3.output คือ การแสดงผลของผลคูนแต่ละตัว จนครบ 12 ตัวคูณ
4.Define a  Variable คือการกำหนดตัวแปร ในนี้กำหนดให้มีตัวแปร ชื่อว่า Number ซึ่งมีตัวแปรเดียว แสดงเพื่อรับค่า
'''

Number = int(input("แม่สูตรคูณ : "))
for i in range(1, 13):
       print(Number,"*" ,i,"=",Number*i)
print("------------------------")