'''
Analysis
1.input คือ การนำข้อมูลเข้าทางแป้นพิมพ์ เช่น ข้อมูลของกรอกจำนวนเงินรายได้ต่อปี, กรอกจำนวนเงินลดหย่อนส่วนตัว , กรอกจำนวนเงินลดหย่อนประกันสังคม ,กรอกจำนวนเงินลดหย่อนต่าสินค้าและบริการ ,  กรอกจำนวนเงินที่ช่วยลดหย่อนชนิดอื่นๆ
2.process คือ การประมวลผลทางการคำนวณ ของจำนวนเงินที่ลดหย่อนได้ทั้งหมด หักกับ รายได้สุทธิ และ นำค่าไปคิดอัตราภาษี 7 %
3.output คือ การแสดงผลข้อจำนวนเเงินอัตราภาษีที่ต้องชำระ
4.Declare Variable คือการกำหนดตัวแปร โดยใช้อักษร เป็นตัวแปรเพื่อใช้ในการเก็บข้อมูลชนิดนั้นๆ
m คือ จำนวนเงินรายปี
c คือ  ส่วนลดจากค่าใช้จ่าย 40 % ของเงินได้
p คือ เงินลดหย่อนส่วนตัว
s คือ เงินลดหย่อนประกันสังคม
k คือ  เงินลดหย่อนต่าสินค้าและบริการ
h คือ เงินที่ช่วยลดหย่อนชนิดอื่นๆ
d คือ ค่าลดหย่อนทั้งหมด
a คือ ค่าที่หลังหักค่าใช้จ่าย
t คือ จำนวนเงินที่ต้องชำระภาษี
'''
m = float (input("กรอกจำนวนเงินรายได้ต่อปี : "))
c = m*0.4						#c คือ ส่วนลดจากค่าใช้จ่าย 40 % ของเงินได้
if ( c > 60001):
	p = float(input("กรอกจำนวนเงินลดหย่อนส่วนตัว : "))
	s = float(input("กรอกจำนวนเงินลดหย่อนประกันสังคม : "))
	k = float(input("กรอกจำนวนเงินลดหย่อนต่าสินค้าและบริการ : "))
	h = float(input("กรอกจำนวนเงินที่ช่วยลดหย่อนชนิดอื่นๆ : "))
	if ( m >= 150001) :
		d = p + s + k + h #d คือค่าลดหย่อนทั้งหมด
		a = m - (c+d)  #a  คือค่าที่หลังหักค่าใช้จ่าย
		t = a * 0.07   #t คือ จำนวนเงินที่ต้องชำระภาษี
		print("จำนวนเงินที่ต้องเสียภาษี", t)
	else:
		M = m < 150001
		print("ยกเว้นภาษี")